app/controllers/auctions_controller.rb

SELECT `auctions`.* FROM `auctions`
---
  def index
    @auctions = Auction.all

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'robertoisai.colombo@bestbuy.com' LIMIT 1
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `auctions` (`user_id`, `product_id`, `amount`, `created_at`, `updated_at`) VALUES (1, 1, 100, '2017-09-26 15:21:01', '2017-09-26 15:21:01')
SELECT MAX(`auctions`.`amount`) FROM `auctions` WHERE `auctions`.`product_id` = 1
---
  def saveAuction
    @user =  User.find_by(email: cookies[:user])
    @oferta = params[:param1]
    @idproducto = params[:param2]
    @product = Product.find(@idproducto)
    if @product.finish_at > Time.now
      @auction = Auction.new(user_id: @user.id,product_id: @idproducto,amount: @oferta)
      respond_to do |format|
        if  @auction.save
          @product = Product.find(params[:param2])
          @max = @product.auctions.maximum(:amount)

INSERT INTO `auctions` (`user_id`, `product_id`, `amount`, `created_at`, `updated_at`) VALUES (1, 1, 2, '2017-09-25 14:07:25', '2017-09-25 14:07:25')
---
  def create
    @auction = Auction.new(auction_params)

    respond_to do |format|
      if @auction.save

DELETE FROM `auctions` WHERE `auctions`.`id` = 1
---
  def destroy
    @auction.destroy

SELECT  `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 76 LIMIT 1
---
    def set_auction
      @auction = Auction.find(params[:id])