app/controllers/products_controller.rb

  def index
    @activeproducts = Product.where(['start_at <= ? AND finish_at >= ?', Time.now, Time.now]).order('start_at ASC')
    @notavailableproducts = Product.where(['start_at >= ?', Time.now]).order('start_at ASC')
    @endedproducts = Product.where(['finish_at <= ?', Time.now]).order('finish_at DESC')
    @myproducts = Product
                      .joins("LEFT JOIN `auctions` ON auctions.product_id = products.id")
                      .joins("LEFT JOIN `users` ON auctions.user_id = users.id")
                      .where("users.id = " + cookies[:iduser])
                      .group("auctions.product_id")
    @user = User.find(cookies[:iduser])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = NULL LIMIT 1
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`user_id` IS NULL AND `auctions`.`product_id` = 4

  def show
    @user = User.find(cookies[:iduser])
    @offerended = 0
    if @product.start_at >= Time.now
      @offerended = 1 #Aun no inicia
      @user.last_seen_at = Time.now
      @user.save
      @current_viewers = User.where("last_seen_at > ?", 5.minutes.ago).count
    end
    if @product.start_at <= Time.now && @product.finish_at >= Time.now
      @offerended = 2 #Activa
      @user.last_seen_at = Time.now
      @user.save
      @current_viewers = User.where("last_seen_at > ?", 5.minutes.ago).count
    end
    if @product.finish_at < Time.now
      @offerended = 3 #Finalizo
      @winners = @product.auctions.select('MAX(auctions.amount) as amount, auctions.user_id').group(:user_id).all.order('amount DESC').limit(@product.qty)
---
SELECT MAX(`auctions`.`amount`) FROM `auctions` WHERE `auctions`.`product_id` = 1

  def getmax
    @product = Product.find(params[:id])
    if @product.auctions.present?
      @max = @product.auctions.maximum(:amount)
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT MAX(`auctions`.`amount`) FROM `auctions` WHERE `auctions`.`product_id` = 1

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `description`, `price`, `price_correa`, `qty`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `qtycorrea`) VALUES ('Apple - Apple Watch Series 1 de 42 mm con Cuerpo de Aluminio y Correa Deportiva Negro - Gris Espacial | Apple Watch', ' DESCRIPCIÓN Te da la información que te interesa cuando y donde la necesitas. Te ayuda a hacer las tareas de siempre más rápido que nunca. Te conecta al instante con la gente y las cosas que más te importan.', '1499', '899', 5, '2017-09-25 15:37:44', '2017-09-25 15:37:44', 'Screen_Shot_2017-09-25_at_10.16.39_AM.png', 'image/png', 194008, '2017-09-25 15:37:44', 3)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `description` = '<h2 style=\"border-bottom: 1px solid #e6e7e7;padding-bottom:10px;\">CARACTERÍSTICAS GENERALES</h2>             <ul>                 <li><b>Marca:</b> Apple</li>                 <li><b>Color:</b> Gris</li>                 <li><b>Tipo de Apple Watch:</b> Deportivo</li>                 <li><b>Tamaño de Pantalla:</b> OLED - 272 x 340 p, Vidrio Ion-X</li>                 <li><b>Material de la Correa:</b> Pulsera deportiva de Fluoroelastómero</li>                 <li><b>Conectividad:</b> IEEE 802.11b/g/n, Bluetooth 4.0</li>                 <li><b>Duración de la Batería:</b> Hasta 18 horas</li>                 <li><b>Resistencia al agua:</b> Resistente al agua hasta 50 metros</li>                  <li><b>Alto:</b> 3.8 cm</li>                 <li><b>Ancho:</b> 3.3 cm</li>                 <li><b>Profundidad:</b> 11.4 cm </li>             </ul>', `image_file_name` = 'Screen_Shot_2017-09-26_at_9.26.41_AM.png', `image_file_size` = 106304, `image_updated_at` = '2017-09-26 14:27:00', `updated_at` = '2017-09-26 14:27:00' WHERE `products`.`id` = 1

  def destroy
    @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 1