app/controllers/users_controller.rb

  def login
    @user = User.find_by(email: params[:param1],useraa: params[:param2])
    if @user.nil?

    else
      @user.useraa = params[:param2]
      @user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'robertoisai.colombo@bestbuy.com' LIMIT 1
UPDATE `users` SET `useraa` = 'aa329751', `updated_at` = '2017-09-29 18:13:13' WHERE `users`.`id` = 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`email`, `name`, `middle`, `created_at`, `updated_at`) VALUES ('gerardoayalad@outlook.com', 'gerardoa', 'Ayala', '2017-09-25 14:07:14', '2017-09-25 14:07:14')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `email` = 'aa321936', `updated_at` = '2017-09-25 16:15:34' WHERE `users`.`id` = 1