app/views/products/index.html.erb

SELECT  `auctions`.* FROM `auctions` WHERE (user) LIMIT 1
SELECT COUNT(*) FROM `auctions` WHERE `auctions`.`product_id` = 4
---

          <span class="no-ofertas"><span class="glyphicon glyphicon-hand-up"></span> <strong><%= product.auctions.count %></strong> Ofertas hasta ahora</span>