app/views/products/show.html.erb

SELECT COUNT(*) FROM `auctions` WHERE `auctions`.`product_id` = 1
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`product_id` = 1
---
            <div class="bloques precio-inicial border-inf">
               <span class="no-ofertas"><span class="glyphicon glyphicon-hand-up"></span><strong><%= @product.auctions.count %></strong> Ofertas hasta ahora </span>

SELECT MAX(`auctions`.`amount`) FROM `auctions` WHERE `auctions`.`product_id` = 1
---
                <% if @product.auctions.present? %>
                  Oferta más alta al momento: <span class="max-offer" style="color:red; font-size:14px"><%= number_to_currency(@product.auctions.maximum(:amount), precision: 0)%></span>